package AndriiVersionAirportProject.airtraffic;

import AndriiVersionAirportProject.booking.Flight;

import java.util.ArrayList;
import java.util.List;

public class FlightScheduleSystem {
    private List<Flight> flights;

    public FlightScheduleSystem() {
        this.flights = new ArrayList<>();
    }

    public List<Flight> getFlight() {
        return flights;
    }

    public void setFlight(List<Flight> flight) {
        this.flights = flight;
    }

    // Метод для добавления нового рейса в расписание
    public void addFlight(Flight flight) {
        flights.add(flight);
    }

    // Метод для обновления информации о рейсе
    public void updateFlight(Flight flight) {
        // Реализуйте логику обновления информации о рейсе
    }

    // Метод для получения списка всех рейсов
    public List<Flight> getAllFlights() {
        return new ArrayList<>(flights);
    }

    // Метод для обработки задержек рейсов
    public void handleDelays() {
        for (Flight flight : flights) {
            if (flight.isDelayed()) {
                // Реализуйте логику обработки задержек
                System.out.println("Flight " + flight.getFlightNumber() + " is delayed.");
            }
        }
    }

    // Метод для обработки отмены рейсов
    public void handleCancellations() {
        for (Flight flight : flights) {
            if (flight.isCancelled()) {
                // Реализуйте логику обработки отмены рейсов
                System.out.println("Flight " + flight.getFlightNumber() + " is cancelled.");
            }
        }
    }


    //TODO Создать файл текстовой файл с расписанием рейсов

}
